Repository: tonmoy-sardar/aerialdiagrams
Catalog: var/langs/*/addons/product_variations.po
Languages: uk_ua

# Addons::name::product_variations
source: Product Variations [Beta]
uk_ua: Вариації товарів [Beta]

# Addons::description::product_variations
source: Variants of a product that comes in more than one option, such as color or size.
uk_ua: Варіанти товару, що включають в себе більше однієї опції, як колір або розмір.

# Languages::product_variations.btn_generate
source: Generate variations
uk_ua: Генерувати варіації

# Languages::product_variations.generating.title
source: Generating variations: [product]
uk_ua: Генерування варіацій: [product]

# Languages::product_variations.generating.select_variants
source: Select variants
uk_ua: Оберіть варіанти

# Languages::product_variations.selected_default
source: Selected by default
uk_ua: Обрано за замовчуванням

# Languages::product_variations.selected_default_tooltip
source: The variation which should be selected by default in the Storefront
uk_ua: Варіація, яка має відображатися на вітрині і бути обраною за замовчуванням при переході на сторінку товара

# Languages::product_variations.product_type
source: Product variations
uk_ua: Вариації товара

# Languages::product_variations.product_type.simple
source: Simple product
uk_ua: Простий товар

# Languages::product_variations.product_type.variation
source: Product variation
uk_ua: Вариація товара

# Languages::product_variations.product_type.configurable
source: Configurable product
uk_ua: Настроюваний товар

# Languages::product_variations.parent_product
source: Parent product
uk_ua: Батьківський товар

# Languages::product_variations.variations
source: Variations
uk_ua: Варіації

# Languages::product_variations.variation_of_product
source: Variation of <a href="[url]">[product]</a>
uk_ua: Варіація <a href="[url]">[product]</a>

source: The variation_options field is required for a variation product
uk_ua: Поле variation_options є обов'язковим для варіації товара

# Languages::product_variations.error.product_variation_must_have_parent_product
source: A product variation must have a parent product
uk_ua: У варіації товара має бути батьківський товар

# Languages::product_variations.error.invalid_variation_options_array
source: The variation_options array is invalid
uk_ua: Масив variation_options невірний

# Languages::product_variations.error.product_variation_already_exists
source: A product variation with same variation_code already exists
uk_ua: Варіація товару з тим же значенням variation_code уже існує

# Languages::product_variations.convert_to_configurable_product
source: Convert to configurable product
uk_ua: Перетворити в налаштовуємий товар

# Languages::product_variations.confirm_convert_to_configurable_product
source: You can't undo this action unless you restore the database from backup or re-create this product as a simple product manually. The option combinations and exceptions (allowed/forbidden combinations) of this product will be lost. Are you sure you want to proceed?
uk_ua: Скасувати дану дію можна, тільки відновивши базу даних з резервної копії або заново створивши даний товар як простий. Комбінації опцій і виключення (дозволені / заборонені комбінації) будуть видалені. Ви впевнені, що хочете продовжити?

# Languages::product_variations.convert_to_configurable_product_success
source: Product successfully converted
uk_ua: Товар було успішно перетворено

# Languages::product_variations.error.configurable_product_must_have_file
source: A downloadable configurable product must have at least one active file for sale.
uk_ua: Цифровий налаштовуємий товар повинен мати хоча б один файл, виставлений на продаж.

# Languages::product_variations.variations_filling
source: Variations
uk_ua: Варіації

# Languages::product_variations.variations_list
source: Variations
uk_ua: Варіації

# Languages::variations_in_stock
source: Only "in stock" products
uk_ua: Відображати лише товари "в наявності"

# Languages::product_variations.variation_code
source: Variation code
uk_ua: Код варіації

# Languages::product_variations.hide_add_to_wishlist_button
source: Hide add to wish list button
uk_ua: Заховати кнопку "В обране"

# Languages::product_variations.cannot_generate_variations_reason_options
source: Cannot generate product variations. You may have removed some product options (or disabled inventory tracking for these options). Some existing variations depend on these options. Please roll back your changes to options or remove existing variations of the product and try to generate them again.
uk_ua: Не вдалося створити варіаціями товару. Можливо, деякі опції товару, що необхідні для створення варіацій було видалено, або їх наявність вже не враховується. Відмініть всі зміни, що застосовані до опцій, або видаліть існуючі варіації і спробуйте згенерувати їх знову.

# Languages::product_variations.cannot_use_all_options_reason_existent_variations
source: Cannot use the following options to generate variations: <b>[option_names]</b>. Some existing variations of the product do not use these options. Please remove existing variations and generate them again to use these options.
uk_ua: Неможливо використовувати такі опції для створення варіацій: <b>[option_names]</b>. Деякі з існуючих варіацій товару не використовують ці опції. Видаліть наявні варіаціїі і згенеруйте їх знову, використовуючі вказані опції.

# Languages::product_variations.variation
source: Variation
uk_ua: Варіація

# Languages::product_variations.update_name
source: Update name
uk_ua: Оновити назву

# Languages::product_variations.add_variations
source: Add variations
uk_ua: Додати варіації

# Languages::product_variations.cannot_change_variation_options
source: Product options cannot be changed
uk_ua: Неможливо змінити опції товару

# Languages::product_variations.please_select_combinations
source: Please select combinations
uk_ua: Будь ласка, оберіть комбінації

# Languages::product_variations.variations_list_block_name
source: Variations list
uk_ua: Список варіацій

# Languages::product_variations.variations_list_tab_name
source: View all options as list
uk_ua: Переглянути список опцій

source: Couldn't import product [product_code]: configurable product can't have variation options.
uk_ua: Не вдалося імпортувати товар [product_code]: у вариацій налаштовуваного товару не повинно бути опцій.

# Languages::product_variations.exim_error_cannot_find_parent_for_variation
source: Couldn't import product [product_code]: the parent product for this variation doesn't exist or is located in a wrong place in the imported file.
uk_ua: Не вдалося імпортувати товар [product_code]: у поточної варіації відсутній батьківський товар, або його розташовано у невірному місці файла, що імпортується.

# Languages::product_variations.exim_error_option_is_not_available
source: Couldn't import product [product_code]: option "[option_name]" is not available for this product variation.
uk_ua: Неможливо імпортувати товар [product_code]: опція "[option_name]" недоступна для даної варіації товару.

# Languages::product_variations.exim_error_invalid_variation_options_format
source: Couldn't import product [product_code]: invalid format of variation options was provided for this variation.
uk_ua: Неможливо імпортувати товар [product_code]: для даної варіації було задано невірний формат опцій.

# Languages::product_variations.exim_error_invalid_variation_options_provided
source: Couldn't import product [product_code]: invalid variation options were provided for this variation.
uk_ua: Не вдалось імпортувати товар [product_code]: для даної варіації були вказані невірні опції.

# Languages::product_variations.exim_error_variation_with_provided_options_exists
source: Couldn't import product [product_code]: a variation with these variation options already exists.
uk_ua: Не вдалось імпортувати товар [product_code]: варіаця з даними опціями вже існує.

source: Couldn't import product [product_code]: a variation must have variation options specified.
uk_ua: Не вдалось імпортувати товар [product_code]: у варіації повинні бути вказані опції.

source: Couldn't import options for product [product_code]: options can't be updated for a variation or for a product that has at least one variation.
uk_ua: Не вдалось імпортувати товар [product_code]: неможливо оновити опції у варіації або товару, якщо у нього є хоча б одна варіація.

# Languages::product_variations.exim_error_variant_does_not_exist
source: Couldn't import product [product_code]: option "[option_name]" doesn't have variant "[variant_name]".
uk_ua: Не вдалось імпортувати товар [product_code]: у опції "[option_name]" відсутній варіант "[variant_name]".

# Languages::product_variations.text_exim_data_imported
source: Data is imported successfully. <br />New products - <b>[new]</b>: <ul><li>Simple: <b>[new_simple]</b></li><li>Configurable: <b>[new_conf]</b></li><li>Variations: <b>[new_var]</b></li></ul>Updated products - <b>[exist]</b>: <ul><li>Simple: <b>[upd_simple]</b></li><li>Configurable: <b>[upd_conf]</b></li><li>Variations: <b>[upd_var]</b></li></ul>Skipped products - <b>[skipped]</b>: <ul><li>Simple: <b>[skipped_simple]</b></li><li>Configurable: <b>[skipped_conf]</b></li><li>Variations: <b>[skipped_var]</b></li></ul>Total - <b>[total]</b>.
uk_ua: Дані успішно імпортовано.<br />нові продукти - <b>[new]</b>: <ul><li>прості: <b>[new_simple]</b></li><li>налаштовувані: <b>[new_conf]</b></li><li>варіації:<b>[new_var]</b></li></ul>Оновлені товари - <b>[exist]</b>:<ul><li>прості: <b>[upd_simple]</b></li><li>налаштовувані:<b>[upd_conf]</b></li><li>варіації: <b>[upd_var]</b></li></ul>пропущено продуктів - <b>[skipped]</b>: <ul><li>прості: <b>[skipped_simple]</b></li><li>налаштовувані: <b>[skipped_conf]</b></li><li>варіації: <b>[skipped_var]</b></li></ul>всього - <b>[total]</b>.

# Languages::variation_options
source: Variation options
uk_ua: Опції варіацій

# Languages::product_variations.cannot_remove_options_that_used_for_variation
source: Cannot delete option "[option_name]" because it is used in product variations. If you'd like to delete this option, please delete the <a href="[search_link]">product variations</a> that use this option first.
uk_ua: Не вдалося видалити опцію "[option_name]", оскільки вона використовується для створення варіацій. Щоб видалити цю опцію, потрібно спочатку видалити <a href="[search_link]">варіації,</a> в яких вона використовується.

# Languages::product_variations.cannot_disable_options_that_used_for_variation
source: Cannot disable option "[option_name]" because it is used in product variations. If you'd like to disable this option, please delete the <a href="[search_link]">product variations</a> that use this option first.
uk_ua: Не вдалося вимкнути опцію "[option_name]", оскільки вона використовується для створення варіацій. Щоб вимкнути цю опцію, потрібно спочатку видалити <a href="[search_link]">варіації,</a> в яких вона використовується.

# Languages::product_variations.show_variation_thumbnails
source: Show variation thumbnails
uk_ua: Показувати іконки варіацій

# Languages::product_variations.show_product_code
source: Show product code
uk_ua: Показати код товару

source: Track in stock product quantity. Enable the "Enable inventory tracking" option (Settings -> General) to modify.
uk_ua: Відстежувати кількість товару в наявності. Увімкніть настройку «Включити відстеження кількості товарів на складі» (Установки → Загальні), щоб змінити значення.

source: Categories to be displayed in the navigation breadcrumbs.
uk_ua: Категорії, які будуть відображатися в навігації («хлібних крихтах»).

# Languages::product_variations.inventory_notice
source: This product doesn't have any options suitable for creating variations. Please make sure that the product has at least one active option with the ticked <b>Inventory</b> checkbox, and variants exist for that option.
uk_ua: У даного товару відсутні опції, які підходять для створення варіацій. Переконайтеся, що у товару включена хоча б одна опція з проставленою галочкою <b>"Розрахунок кількості товару в наявності"</b>, і у цій опції є варіанти.

# Languages::product_variations.error.cannot_disable_option_variant
source: Variant "[variant_name]" can't be disabled because some existing product variations use it.
uk_ua: Неможливо вимкнути варіант "[variant_name]", бо він використовується в існуючих варіаціях товарів.

# Languages::product_variations.error.cannot_remove_option_variant
source: Variant "[variant_name]" can't be removed because some existing product variations use it.
uk_ua: Неможливо видалити варіант "[variant_name]", бо він використовується в існуючих варіаціях товарів.

# Languages::is_default_product_variation
source: Is default product variation
uk_ua: Є варіацією, що обрано за замовчуванням
